ConfigFiles/Enums/СостоянияИсправленияОшибок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостоянияИсправленияОшибок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяИсправление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исправлена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсправлениеНеПланируется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкиНеБылоВЭтойВетке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсправляетсяВОтдельнойОшибке</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ConfigFiles/Enums/СостоянияИсправленияОшибок/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить(Перечисления.СостоянияИсправленияОшибок.ТребуетсяИсправление);
	СписокВыбора.Добавить(Перечисления.СостоянияИсправленияОшибок.Исправлена);
	СписокВыбора.Добавить(Перечисления.СостоянияИсправленияОшибок.ИсправлениеНеПланируется);
	СписокВыбора.Добавить(Перечисления.СостоянияИсправленияОшибок.ОшибкиНеБылоВЭтойВетке);
		
	ДанныеВыбора = СписокВыбора;
	
	СтандартнаяОбработка = Ложь;
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
